In [67]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Dataset Setup

In [68]:
first_data = pd.read_csv('DataSets/spam.csv')
second_data = pd.read_csv('DataSets/spam_ham_dataset.csv')

In [69]:
first_data.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [70]:
second_data.head(100)

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0
...,...,...,...,...
95,2432,ham,Subject: take 30 % off with our super ticket !...,0
96,2012,ham,Subject: updated list\r\nvalero deals have now...,0
97,2862,ham,"Subject: hpl nom for march 27 , 2001\r\n( see ...",0
98,4095,spam,Subject: what she doesnt know sprig bashaw\r\n...,1
99,2782,ham,Subject: mobil beaumont\r\nbrian nichols of ex...,0

In [71]:
# Working With First Data
first_data.drop(columns=['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], inplace=True)

In [72]:
first_data.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [73]:
first_data.rename(columns={'v1': "Label", 'v2': "Text"}, inplace=True)

In [74]:
# Working With Second Data
second_data.drop(columns=['Unnamed: 0', 'label_num'], inplace=True)

In [75]:
second_data.rename(columns={'label': "Label", 'text': "Text"}, inplace=True)

In [76]:
first_data.head()

  Label                                               Text
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [77]:
second_data.head()

  Label                                               Text
0   ham  Subject: enron methanol ; meter # : 988291\r\n...
1   ham  Subject: hpl nom for january 9 , 2001\r\n( see...
2   ham  Subject: neon retreat\r\nho ho ho , we ' re ar...
3  spam  Subject: photoshop , windows , office . cheap ...
4   ham  Subject: re : indian springs\r\nthis deal is t...

In [83]:
# Creating One Dataset From Two Datasets
frames = [first_data, second_data]
df = pd.concat(frames)

In [84]:
df.head()

  Label                                               Text
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [85]:
first_data.shape

(5572, 2)

In [86]:
second_data.shape

(5171, 2)

In [87]:
df.shape

(10743, 2)